report/exp1httperfoutputs.txt
httperf --timeout=1 --client=0/1 --server=localhost --port=8080 --uri=/test_dir/images/mn.jpg --send-buffer=4096 --recv-buffer=16384 --num-conns=200 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 200 requests 200 replies 200 test-duration 20.026 s

Connection rate: 10.0 conn/s (100.1 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 89.2 avg 100.1 max 192.6 median 97.5 stddev 9.4
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 10.0 req/s (100.1 ms/req)
Request size [B]: 84.0

Reply rate [replies/s]: min 9.8 avg 10.0 max 10.2 stddev 0.2 (4 samples)
Reply time [ms]: response 70.9 transfer 29.1
Reply size [B]: header 127.0 content 2598587.0 footer 0.0 (total 2598714.0)
Reply status: 1xx=0 2xx=200 3xx=0 4xx=0 5xx=0

CPU time [s]: user 3.94 system 15.18 (user 19.7% system 75.8% total 95.5%)
Net I/O: 25345.9 KB/s (207.6*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0


httperf --timeout=1 --client=0/1 --server=localhost --port=8080 --uri=/test_dir/images/mn.jpg --send-buffer=4096 --recv-buffer=16384 --num-conns=400 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 400 requests 400 replies 400 test-duration 50.461 s

Connection rate: 7.9 conn/s (126.2 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 84.4 avg 126.2 max 381.6 median 119.5 stddev 43.2
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 7.9 req/s (126.2 ms/req)
Request size [B]: 84.0

Reply rate [replies/s]: min 6.8 avg 7.9 max 9.6 stddev 0.7 (10 samples)
Reply time [ms]: response 85.0 transfer 41.0
Reply size [B]: header 127.0 content 2598587.0 footer 0.0 (total 2598714.0)
Reply status: 1xx=0 2xx=400 3xx=0 4xx=0 5xx=0

CPU time [s]: user 10.09 system 38.79 (user 20.0% system 76.9% total 96.9%)
Net I/O: 20117.6 KB/s (164.8*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0


httperf --timeout=1 --client=0/1 --server=localhost --port=8080 --uri=/test_dir/images/mn.jpg --send-buffer=4096 --recv-buffer=16384 --num-conns=600 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 600 requests 600 replies 600 test-duration 61.532 s

Connection rate: 9.8 conn/s (102.6 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 86.4 avg 102.6 max 354.2 median 97.5 stddev 18.9
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 9.8 req/s (102.6 ms/req)
Request size [B]: 84.0

Reply rate [replies/s]: min 7.2 avg 9.8 max 10.2 stddev 0.9 (12 samples)
Reply time [ms]: response 71.9 transfer 30.5
Reply size [B]: header 127.0 content 2598587.0 footer 0.0 (total 2598714.0)
Reply status: 1xx=0 2xx=600 3xx=0 4xx=0 5xx=0

CPU time [s]: user 12.07 system 47.12 (user 19.6% system 76.6% total 96.2%)
Net I/O: 24747.1 KB/s (202.7*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0


httperf --timeout=1 --client=0/1 --server=localhost --port=8080 --uri=/test_dir/images/mn.jpg --send-buffer=4096 --recv-buffer=16384 --num-conns=800 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 800 requests 800 replies 800 test-duration 79.611 s

Connection rate: 10.0 conn/s (99.5 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 85.5 avg 99.5 max 180.3 median 96.5 stddev 7.8
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 10.0 req/s (99.5 ms/req)
Request size [B]: 84.0

Reply rate [replies/s]: min 9.6 avg 10.0 max 10.2 stddev 0.2 (15 samples)
Reply time [ms]: response 70.2 transfer 29.1
Reply size [B]: header 127.0 content 2598587.0 footer 0.0 (total 2598714.0)
Reply status: 1xx=0 2xx=800 3xx=0 4xx=0 5xx=0

CPU time [s]: user 15.73 system 60.63 (user 19.8% system 76.2% total 95.9%)
Net I/O: 25502.9 KB/s (208.9*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0


httperf --timeout=1 --client=0/1 --server=localhost --port=8080 --uri=/test_dir/images/mn.jpg --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 1000 requests 1000 replies 1000 test-duration 99.354 s

Connection rate: 10.1 conn/s (99.4 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 85.2 avg 99.4 max 182.4 median 97.5 stddev 7.4
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 10.1 req/s (99.4 ms/req)
Request size [B]: 84.0

Reply rate [replies/s]: min 9.8 avg 10.1 max 10.2 stddev 0.1 (19 samples)
Reply time [ms]: response 69.6 transfer 29.5
Reply size [B]: header 127.0 content 2598587.0 footer 0.0 (total 2598714.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 19.50 system 75.88 (user 19.6% system 76.4% total 96.0%)
Net I/O: 25544.0 KB/s (209.3*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0



=== persis ======


httperf --timeout=1 --client=0/1 --server=localhost --port=8098 --uri=/test_dir/images/mn.jpg --send-buffer=4096 --recv-buffer=16384 --add-header='Connection: keep-alive\n' --num-conns=200 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 200 requests 200 replies 200 test-duration 28.600 s

Connection rate: 7.0 conn/s (143.0 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 107.1 avg 143.0 max 389.4 median 137.5 stddev 29.9
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 7.0 req/s (143.0 ms/req)
Request size [B]: 108.0

Reply rate [replies/s]: min 6.4 avg 6.8 max 8.0 stddev 0.7 (5 samples)
Reply time [ms]: response 100.5 transfer 42.4
Reply size [B]: header 166.0 content 2598587.0 footer 0.0 (total 2598753.0)
Reply status: 1xx=0 2xx=200 3xx=0 4xx=0 5xx=0

CPU time [s]: user 5.69 system 21.89 (user 19.9% system 76.5% total 96.4%)
Net I/O: 17748.0 KB/s (145.4*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0



httperf --timeout=1 --client=0/1 --server=localhost --port=8098 --uri=/test_dir/images/mn.jpg --send-buffer=4096 --recv-buffer=16384 --add-header='Connection: keep-alive\n' --num-conns=400 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 400 requests 400 replies 400 test-duration 50.173 s

Connection rate: 8.0 conn/s (125.4 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 104.3 avg 125.4 max 189.9 median 124.5 stddev 9.8
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 8.0 req/s (125.4 ms/req)
Request size [B]: 108.0

Reply rate [replies/s]: min 7.6 avg 8.0 max 8.2 stddev 0.2 (10 samples)
Reply time [ms]: response 90.0 transfer 35.2
Reply size [B]: header 166.0 content 2598587.0 footer 0.0 (total 2598753.0)
Reply status: 1xx=0 2xx=400 3xx=0 4xx=0 5xx=0

CPU time [s]: user 9.50 system 37.31 (user 18.9% system 74.4% total 93.3%)
Net I/O: 20233.5 KB/s (165.8*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0



httperf --timeout=1 --client=0/1 --server=localhost --port=8098 --uri=/test_dir/images/mn.jpg --send-buffer=4096 --recv-buffer=16384 --add-header='Connection: keep-alive\n' --num-conns=600 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 600 requests 600 replies 600 test-duration 77.263 s

Connection rate: 7.8 conn/s (128.8 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 104.1 avg 128.8 max 220.1 median 126.5 stddev 13.0
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 7.8 req/s (128.8 ms/req)
Request size [B]: 108.0

Reply rate [replies/s]: min 7.4 avg 7.8 max 8.4 stddev 0.3 (15 samples)
Reply time [ms]: response 92.3 transfer 36.3
Reply size [B]: header 166.0 content 2598587.0 footer 0.0 (total 2598753.0)
Reply status: 1xx=0 2xx=600 3xx=0 4xx=0 5xx=0

CPU time [s]: user 13.60 system 52.84 (user 17.6% system 68.4% total 86.0%)
Net I/O: 19708.8 KB/s (161.5*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0



httperf --timeout=1 --client=0/1 --server=localhost --port=8098 --uri=/test_dir/images/mn.jpg --send-buffer=4096 --recv-buffer=16384 --add-header='Connection: keep-alive\n' --num-conns=1000 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 1000 requests 1000 replies 1000 test-duration 134.704 s

Connection rate: 7.4 conn/s (134.7 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 106.3 avg 134.7 max 349.5 median 128.5 stddev 25.4
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 7.4 req/s (134.7 ms/req)
Request size [B]: 108.0

Reply rate [replies/s]: min 5.0 avg 7.4 max 8.2 stddev 0.8 (26 samples)
Reply time [ms]: response 95.7 transfer 38.7
Reply size [B]: header 166.0 content 2598587.0 footer 0.0 (total 2598753.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 23.26 system 90.90 (user 17.3% system 67.5% total 84.7%)
Net I/O: 18841.0 KB/s (154.3*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0



httperf --timeout=1 --client=0/1 --server=localhost --port=8098 --uri=/test_dir/images/mn.jpg --send-buffer=4096 --recv-buffer=16384 --add-header='Connection: keep-alive\n' --num-conns=800 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 800 requests 800 replies 800 test-duration 101.526 s

Connection rate: 7.9 conn/s (126.9 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 103.1 avg 126.9 max 212.7 median 125.5 stddev 11.1
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 7.9 req/s (126.9 ms/req)
Request size [B]: 108.0

Reply rate [replies/s]: min 7.4 avg 7.9 max 8.2 stddev 0.2 (20 samples)
Reply time [ms]: response 91.2 transfer 35.6
Reply size [B]: header 166.0 content 2598587.0 footer 0.0 (total 2598753.0)
Reply status: 1xx=0 2xx=800 3xx=0 4xx=0 5xx=0

CPU time [s]: user 18.77 system 72.99 (user 18.5% system 71.9% total 90.4%)
Net I/O: 19998.4 KB/s (163.8*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0



==== Pipelined ====

httperf --timeout=1 --client=0/1 --server=localhost --port=8099 --uri=/test_dir/images/mn.jpg --send-buffer=4096 --recv-buffer=16384 --add-header='Connection: keep-alive\n' --num-conns=200 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 200 requests 200 replies 200 test-duration 25.033 s

Connection rate: 8.0 conn/s (125.2 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 102.5 avg 125.2 max 244.0 median 120.5 stddev 17.6
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 8.0 req/s (125.2 ms/req)
Request size [B]: 108.0

Reply rate [replies/s]: min 7.2 avg 8.0 max 8.2 stddev 0.4 (5 samples)
Reply time [ms]: response 91.3 transfer 33.7
Reply size [B]: header 166.0 content 2598587.0 footer 0.0 (total 2598753.0)
Reply status: 1xx=0 2xx=200 3xx=0 4xx=0 5xx=0

CPU time [s]: user 4.97 system 19.16 (user 19.8% system 76.5% total 96.4%)
Net I/O: 20276.6 KB/s (166.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0



httperf --timeout=1 --client=0/1 --server=localhost --port=8099 --uri=/test_dir/images/mn.jpg --send-buffer=4096 --recv-buffer=16384 --add-header='Connection: keep-alive\n' --num-conns=400 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 400 requests 400 replies 400 test-duration 50.224 s

Connection rate: 8.0 conn/s (125.6 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 105.3 avg 125.6 max 195.1 median 123.5 stddev 10.8
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 8.0 req/s (125.6 ms/req)
Request size [B]: 108.0

Reply rate [replies/s]: min 7.6 avg 8.0 max 8.2 stddev 0.2 (10 samples)
Reply time [ms]: response 90.7 transfer 34.7
Reply size [B]: header 166.0 content 2598587.0 footer 0.0 (total 2598753.0)
Reply status: 1xx=0 2xx=400 3xx=0 4xx=0 5xx=0

CPU time [s]: user 9.40 system 36.37 (user 18.7% system 72.4% total 91.1%)
Net I/O: 20213.1 KB/s (165.6*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0


httperf --timeout=1 --client=0/1 --server=localhost --port=8099 --uri=/test_dir/images/mn.jpg --send-buffer=4096 --recv-buffer=16384 --add-header='Connection: keep-alive\n' --num-conns=600 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 600 requests 600 replies 600 test-duration 75.562 s

Connection rate: 7.9 conn/s (125.9 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 104.5 avg 125.9 max 230.6 median 122.5 stddev 14.1
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 7.9 req/s (125.9 ms/req)
Request size [B]: 108.0

Reply rate [replies/s]: min 6.6 avg 7.9 max 8.2 stddev 0.4 (15 samples)
Reply time [ms]: response 91.8 transfer 33.9
Reply size [B]: header 166.0 content 2598587.0 footer 0.0 (total 2598753.0)
Reply status: 1xx=0 2xx=600 3xx=0 4xx=0 5xx=0

CPU time [s]: user 14.65 system 56.64 (user 19.4% system 75.0% total 94.3%)
Net I/O: 20152.7 KB/s (165.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0



httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 800 requests 800 replies 800 test-duration 101.774 s

Connection rate: 7.9 conn/s (127.2 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 108.9 avg 127.2 max 222.2 median 126.5 stddev 10.6
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 7.9 req/s (127.2 ms/req)
Request size [B]: 108.0

Reply rate [replies/s]: min 7.4 avg 7.9 max 8.2 stddev 0.2 (20 samples)
Reply time [ms]: response 91.7 transfer 35.4
Reply size [B]: header 166.0 content 2598587.0 footer 0.0 (total 2598753.0)
Reply status: 1xx=0 2xx=800 3xx=0 4xx=0 5xx=0

CPU time [s]: user 18.55 system 72.55 (user 18.2% system 71.3% total 89.5%)
Net I/O: 19949.6 KB/s (163.4*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0



Maximum connect burst length: 1

Total: connections 1000 requests 1000 replies 1000 test-duration 139.559 s

Connection rate: 7.2 conn/s (139.6 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 109.9 avg 139.6 max 397.2 median 134.5 stddev 22.9
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 7.2 req/s (139.6 ms/req)
Request size [B]: 108.0

Reply rate [replies/s]: min 6.2 avg 7.1 max 8.0 stddev 0.6 (27 samples)
Reply time [ms]: response 98.2 transfer 41.2
Reply size [B]: header 166.0 content 2598587.0 footer 0.0 (total 2598753.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 26.04 system 101.79 (user 18.7\% system 72.9\% total 91.6\%)
Net I/O: 18185.4 KB/s (149.0*10\^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0



=== APACHE === 

httperf --server 127.0.0.1 \
   --port 80 \
   --uri /mn.jpg \
   --num-conn 200 \
   --num-call 1 --timeout 1 \
   --add-header='Connection: keep-alive\n'

   httperf --timeout=1 --client=0/1 --server=127.0.0.1 --port=80 --uri=/mn.jpg --send-buffer=4096 --recv-buffer=16384 --add-header='Connection: keep-alive\n' --num-conns=200 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 200 requests 200 replies 196 test-duration 5.050 s

Connection rate: 39.6 conn/s (25.2 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.9 avg 5.3 max 15.2 median 5.5 stddev 1.1
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 1.000

Request rate: 39.6 req/s (25.2 ms/req)
Request size [B]: 92.0

Reply rate [replies/s]: min 37.2 avg 37.2 max 37.2 stddev 0.0 (1 samples)
Reply time [ms]: response 0.2 transfer 5.0
Reply size [B]: header 291.0 content 2598587.0 footer 0.0 (total 2598878.0)
Reply status: 1xx=0 2xx=196 3xx=0 4xx=0 5xx=0

CPU time [s]: user 1.05 system 3.97 (user 20.8% system 78.7% total 99.5%)
Net I/O: 98507.7 KB/s (807.0*10^6 bps)

Errors: total 4 client-timo 4 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0



httperf --timeout=1 --client=0/1 --server=127.0.0.1 --port=80 --uri=/mn.jpg --send-buffer=4096 --recv-buffer=16384 --add-header='Connection: keep-alive\n' --num-conns=400 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 400 requests 400 replies 384 test-duration 18.390 s

Connection rate: 21.8 conn/s (46.0 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.4 avg 6.2 max 103.3 median 5.5 stddev 8.7
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 1.000

Request rate: 21.8 req/s (46.0 ms/req)
Request size [B]: 92.0

Reply rate [replies/s]: min 8.2 avg 12.3 max 18.4 stddev 5.4 (3 samples)
Reply time [ms]: response 0.2 transfer 5.9
Reply size [B]: header 291.0 content 2598587.0 footer 0.0 (total 2598878.0)
Reply status: 1xx=0 2xx=384 3xx=0 4xx=0 5xx=0

CPU time [s]: user 3.58 system 14.70 (user 19.5% system 79.9% total 99.4%)
Net I/O: 52996.5 KB/s (434.1*10^6 bps)

Errors: total 16 client-timo 16 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0



httperf --timeout=1 --client=0/1 --server=127.0.0.1 --port=80 --uri=/mn.jpg --send-buffer=4096 --recv-buffer=16384 --add-header='Connection: keep-alive\n' --num-conns=600 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 600 requests 600 replies 586 test-duration 17.218 s

Connection rate: 34.8 conn/s (28.7 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.6 avg 5.5 max 100.5 median 5.5 stddev 4.0
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 1.000

Request rate: 34.8 req/s (28.7 ms/req)
Request size [B]: 92.0

Reply rate [replies/s]: min 13.8 avg 35.7 max 68.2 stddev 28.7 (3 samples)
Reply time [ms]: response 0.2 transfer 5.2
Reply size [B]: header 291.0 content 2598587.0 footer 0.0 (total 2598878.0)
Reply status: 1xx=0 2xx=586 3xx=0 4xx=0 5xx=0

CPU time [s]: user 3.57 system 13.54 (user 20.8% system 78.7% total 99.4%)
Net I/O: 86378.8 KB/s (707.6*10^6 bps)

Errors: total 14 client-timo 14 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0



httperf --timeout=1 --client=0/1 --server=127.0.0.1 --port=80 --uri=/mn.jpg --send-buffer=4096 --recv-buffer=16384 --add-header='Connection: keep-alive\n' --num-conns=800 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 800 requests 800 replies 777 test-duration 27.340 s

Connection rate: 29.3 conn/s (34.2 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.4 avg 5.6 max 103.4 median 5.5 stddev 5.0
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 1.000

Request rate: 29.3 req/s (34.2 ms/req)
Request size [B]: 92.0

Reply rate [replies/s]: min 18.8 avg 28.4 max 36.2 stddev 6.6 (5 samples)
Reply time [ms]: response 0.2 transfer 5.2
Reply size [B]: header 291.0 content 2598587.0 footer 0.0 (total 2598878.0)
Reply status: 1xx=0 2xx=777 3xx=0 4xx=0 5xx=0

CPU time [s]: user 5.75 system 21.41 (user 21.0% system 78.3% total 99.3%)
Net I/O: 72131.0 KB/s (590.9*10^6 bps)

Errors: total 23 client-timo 23 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0



httperf --timeout=1 --client=0/1 --server=127.0.0.1 --port=80 --uri=/mn.jpg --send-buffer=4096 --recv-buffer=16384 --add-header='Connection: keep-alive\n' --num-conns=1000 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 1000 requests 1000 replies 958 test-duration 48.081 s

Connection rate: 20.8 conn/s (48.1 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.4 avg 6.3 max 103.3 median 5.5 stddev 9.4
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 1.000

Request rate: 20.8 req/s (48.1 ms/req)
Request size [B]: 92.0

Reply rate [replies/s]: min 6.8 avg 19.6 max 28.6 stddev 7.5 (9 samples)
Reply time [ms]: response 0.2 transfer 6.0
Reply size [B]: header 291.0 content 2598587.0 footer 0.0 (total 2598878.0)
Reply status: 1xx=0 2xx=958 3xx=0 4xx=0 5xx=0

CPU time [s]: user 9.95 system 37.55 (user 20.7% system 78.1% total 98.8%)
Net I/O: 50569.6 KB/s (414.3*10^6 bps)

Errors: total 42 client-timo 42 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0